Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: བདག་གི་གོ་ཆ་འདི་ནི་བདག་རྣམ་པར་གཞིག་པའི་ཕྱིར་གོ་ཆ་བགོས་པ་མ་ཡིན། སེམས་ཅན་དང་། སྲོག་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་རྣམ་པར་གཞིག་པའི་ཕྱིར་བགོས་པ་མ་ཡིན་གྱི་སེམས་ཅན་དག་གང་ལ་བརྟེན་ནས་
en: ‘I am not wearing this armor so that I may dismantle the self, nor am I am wearing it so that I may dismantle a being, a life force, sustenance, a person, or personhood.

source: བདག་དང་། སེམས་ཅན་དང་། སྲོག་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་ཏུ་ལྟ་བ་ལ་གནས་པར་བྱེད་པའི་གནས་པ་དེ་བདག་གིས་སྤང་བར་བྱའོ་སྙམ་དུ་སེམས་སོ་
en: Instead, I will abandon the entire basis for beings to sustain the view of self, beings, life force, sustenance, people, or personhood.

source: གནས་དེ་གང་ཞེ་ན།
en: What is this basis?

source: འདི་ལྟ་སྟེ། ཕྱིན་ཅི་ལོག་ནི་གནས་སོ། །
en: The basis is being mistaken.

source: ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ནི་གནས་སོ། །
en: The aggregates, elements, and sense sources are the basis.

source: དེ་འདི་ལྟར་སེམས་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་ཏེ་མི་རྟག་པ་ལ་རྟག་པར་འདུ་ཤེས་པ། སྡུག་བསྔལ་བ་ལ་བདེ་བར་འདུ་ཤེས་པ། བདག་མེད་པ་ལ་བདག་ཏུ་འདུ་ཤེས་པ། མི་སྡུག་པ་ལ་སྡུག་པར་འདུ་ཤེས་པ་རྣམས་ལ་
en: As their minds are mistaken in this regard, beings perceive what is impermanent to be permanent, what is suffering to be happiness, what is not a self to be a self, and what is ugly to be attractive.

source: འདུ་ཤེས་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏེ།
en: Now, so that they may come to understand perception , I will teach them the Dharma.’

source: དེ་ལ་འདུ་ཤེས་ཡོངས་སུ་ཤེས་པ་གང་ཞེ་ན།
en: “What does it mean to understand perception ?

source: འདི་ལྟ་སྟེ། འཛིན་པ་མེད་པ་དང་། མཆོག་ཏུ་འཛིན་པ་མེད་པའོ། །
en: It is to be without grasping or clinging.

source: གང་འཛིན་པ་མེད་པ་དེ་མཆོག་ཏུ་འཛིན་པར་མི་བྱེད་དོ། །
en: When one does not grasp, one does not cling.

source: གང་མཆོག་ཏུ་འཛིན་པར་མི་བྱེད་པ་དེ་ཀུན་ཏུ་རྨོངས་པ་མེད་དོ། །
en: When one does not cling, there is no delusion.

source: དེ་ཀུན་ཏུ་རྨོངས་པ་མེད་པས་འདུ་ཤེས་ཡོངས་སུ་ཤེས་སོ། །
en: When there is no delusion, one understands perception .”

source: གསོལ་པ་ཅི་ལགས་འདས་པ་རྣམས་ཀྱིའམ། མ་འོངས་པ་རྣམས་ཀྱིའམ། ད་ལྟར་བྱུང་བ་རྣམས་ཀྱིའམ། འདུ་ཤེས་གང་ཡོངས་སུ་འཚལ།
en: “Does one then understand past, present, or future perceptions ?”

source: འདས་པ་རྣམས་ཀྱི་ཡང་མ་ཡིན། མ་འོངས་པ་རྣམས་ཀྱི་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་རྣམས་ཀྱི་ཡང་མ་ཡིན་ནོ། །
en: “Neither past, nor present, nor future perceptions !

source: འདས་པའི་འདུ་ཤེས་ནི་ཟད་པའོ། །
en: Past perceptions are exhausted.

source: མ་འོངས་པ་ནི་མ་ཕྱིན་པའོ། །
en: Present perceptions do not remain.

source: ད་ལྟར་བྱུང་བའི་འདུ་ཤེས་རྣམས་ནི་གནས་པ་མེད་པ་སྟེ།
en: Future perceptions have not yet come.

source: གང་དུས་གསུམ་དུ་འདུ་ཤེས་མི་དམིགས་པ་ནི་འདུ་ཤེས་ཡོངས་སུ་ཤེས་པའོ། །
en: One understands perception when one no longer observes perceptions in any of the three times.

source: དེ་འདུ་ཤེས་ཡོངས་སུ་ཤེས་པ་དང་ལྡན་པར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་དག་པ་སྤྱོད་དོ། །
en: Then, having this understanding of perception , the conduct of bodhisattvas is pure.

source: དེ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: They completely understand the conduct of all beings.

source: བློ་གྲོས་རྒྱ་མཚོ་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཇི་སྲིད་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་རབ་ཏུ་མི་ཤེས་པ། དེ་སྲིད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་དག་པ་ལ་སྤྱོད་པ་མ་ཡིན་ཏེ།
en: “Sāgaramati, bodhisattvas’ conduct will be impure to the degree that they fail to understand the conduct of beings.

source: གང་གི་ཚེ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་རབ་ཏུ་ཤེས་པ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་དག་པ་ལ་སྤྱད་དོ། །
en: When they understand the conduct of beings, their bodhisattva conduct will be pure.

source: ཇི་ལྟར་དེ་དག་གི་སྤྱོད་པ་རྣམས་རབ་ཏུ་ཤེས་པ་དེ་ལྟར་ཆོས་སྟོན་ཏོ། །
en: They will teach the Dharma in accord with their understanding of these modes of conduct.

source: སེམས་ཅན་སྤྱོད་པ་ཇི་ལྟ་བ་རྣམས་ཀྱི་སྤྱོད་པ་དེ་བཟློག་པའི་ཕྱིར་ཡང་ཉེ་བར་སྟོན་ཏོ། །
en: They will teach in order to reverse the different kinds of beings’ conduct.

source: བློ་གྲོས་རྒྱ་མཚོ་འདོད་ཆགས་ཀྱི་བསམ་པ་ཅན་ལ་ཞེ་སྡང་ལ་སྦྱོར་བའི་བསམ་པ་ཅན་དག་ཀྱང་ཡོད།
en: “Sāgaramati, there are those who have desirous thoughts who also are involved in aggression.

source: ཞེ་སྡང་གི་བསམ་པ་ཅན་ལ་འདོད་ཆགས་ལ་སྦྱོར་བ་དག་ཀྱང་ཡོད།
en: There are those who have aggressive thoughts who also are involved in desire.

source: ཞེ་སྡང་གི་བསམ་པ་ཅན་ལ་གཏི་མུག་ལ་སྦྱོར་བ་དག་ཀྱང་ཡོད།
en: There are those who have aggressive thoughts who also are involved in stupidity.

source: གཏི་མུག་གི་བསམ་པ་ཅན་ལ་ཞེ་སྡང་ལ་སྦྱོར་བ་དག་ཀྱང་ཡོད།
en: There are those who have stupid thoughts who also are involved in aggression.

source: གཏི་མུག་གི་བསམ་པ་ཅན་ལ་འདོད་ཆགས་ལ་སྦྱོར་བ་དག་ཀྱང་ཡོད།
en: There are those who have stupid thoughts who also are involved in desire.

source: འདོད་ཆགས་ཀྱི་བསམ་པ་ཅན་ལ་གཏི་མུག་ལ་སྦྱོར་བ་དག་ཀྱང་ཡོད།
en: There are those who have desirous thoughts who also are involved in stupidity.

source: འདོད་ཆགས་དང་ཞེ་སྡང་གི་བསམ་པ་ཅན་ལ་གཏི་མུག་ལ་སྦྱོར་བ་དག་ཀྱང་ཡོད།
en: There are those who have desirous and aggressive thoughts who also are involved in stupidity.

source: ཞེ་སྡང་དང་གཏི་མུག་གི་བསམ་པ་ཅན་ལ་འདོད་ཆགས་ལ་སྦྱོར་བ་དག་ཀྱང་ཡོད།
en: There are those who have aggressive and stupid thoughts who also are involved in desire.

source: གཏི་མུག་དང་འདོད་ཆགས་ཀྱི་བསམ་པ་ཅན་ལ་ཞེ་སྡང་ལ་སྦྱོར་བ་དག་ཀྱང་ཡོད་དོ། །
en: There are those who have stupid and desirous thoughts who also are involved in aggression.

source: བློ་གྲོས་རྒྱ་མཚོ་འདོད་ཆགས་བཅོས་མ་ཅན་ལ་ཞེ་སྡང་ཚར་གཅད་པར་བྱ་བའི་སེམས་ཅན་དག་ཀྱང་ཡོད།
en: “Sāgaramati, there are some who engage in desire who should eliminate aggression.

source: ཞེ་སྡང་བཅོས་མ་ཅན་ལ་འདོད་ཆགས་ཚར་གཅད་པར་བྱ་བ་དག་ཀྱང་ཡོད།
en: There are some who engage in aggression who should eliminate desire.

source: ཞེ་སྡང་བཅོས་མ་ཅན་ལ་གཏི་མུག་ཚར་གཅད་པར་བྱ་བ་དག་ཀྱང་ཡོད།
en: There are some who engage in aggression who should eliminate stupidity.

source: གཏི་མུག་བཅོས་མ་ཅན་ལ་ཞེ་སྡང་ཚར་གཅད་པར་བྱ་བ་དག་ཀྱང་ཡོད།
en: There are some who engage in stupidity who should eliminate aggression.

source: གཏི་མུག་བཅོས་མ་ཅན་ལ་འདོད་ཆགས་ཚར་གཅད་པར་བྱ་བ་དག་ཀྱང་ཡོད།
en: There are some who engage in stupidity who should eliminate desire.

source: འདོད་ཆགས་བཅོས་མ་ཅན་ལ་གཏི་མུག་ཚར་གཅད་པར་བྱ་བ་དག་ཀྱང་ཡོད།
en: There are some who engage in desire who should eliminate stupidity.

source: འདོད་ཆགས་དང་ཞེ་སྡང་བཅོས་མ་ཅན་ལ་གཏི་མུག་ཚར་གཅད་པར་བྱ་བ་དག་ཀྱང་ཡོད།
en: There are some who engage in desire or aggression who should eliminate stupidity.

source: ཞེ་སྡང་དང་གཏི་མུག་བཅོས་མ་ཅན་ལ་འདོད་ཆགས་ཚར་གཅད་པར་བྱ་བ་དག་ཀྱང་ཡོད།
en: There are some who engage in aggression or stupidity who should eliminate desire.

source: གཏི་མུག་དང་འདོད་ཆགས་བཅོས་མ་ཅན་ལ་ཞེ་སྡང་ཚར་གཅད་པར་བྱ་བ་དག་ཀྱང་ཡོད་དོ། །
en: There are some who engage in stupidity or desire who should eliminate aggression.

source: བློ་གྲོས་རྒྱ་མཚོ་སྔར་འདོད་ཆགས་ཅན་ལ་ཕྱིས་ཞེ་སྡང་ཅན་དང་།
en: “Sāgaramati, there are those who are first desirous and then aggressive.

source: སྔར་ཞེ་སྡང་ཅན་ལ་ཕྱིས་འདོད་ཆགས་ཅན་དང་།
en: There are beings who are first aggressive and then desirous.

source: སྔར་ཞེ་སྡང་ཅན་ལ་ཕྱིས་གཏི་མུག་ཅན་དང་།
en: There are beings who are first aggressive and then stupid.

source: སྔར་གཏི་མུག་ཅན་ལ་ཕྱིས་ཞེ་སྡང་ཅན་དང་།
en: There are beings who are first stupid and then aggressive.

source: སྔར་གཏི་མུག་ཅན་ལ་ཕྱིས་འདོད་ཆགས་ཅན་དང་།
en: There are beings who are first stupid and then desirous.

source: སྔར་འདོད་ཆགས་ཅན་ལ་ཕྱིས་གཏི་མུག་ཅན་དང་།
en: There are beings who are first desirous and then stupid.

source: སྔར་འདོད་ཆགས་དང་ཞེ་སྡང་ཅན་ལ་ཕྱིས་གཏི་མུག་ཅན་དང་།
en: There are beings who are first desirous and aggressive and then stupid.

source: སྔར་ཞེ་སྡང་དང་གཏི་མུག་ཅན་ལ་ཕྱིས་འདོད་ཆགས་ཅན་དང་།
en: There are beings who are first aggressive and stupid and then desirous.

source: སྔར་གཏི་མུག་དང་འདོད་ཆགས་ཅན་ལ་ཕྱིས་ཞེ་སྡང་ཅན་གྱི་སེམས་ཅན་དག་ཀྱང་ཡོད་དོ། །
en: There are beings who are first stupid and desirous and then aggressive.

source: བློ་གྲོས་རྒྱ་མཚོ་གཟུགས་ལ་འདོད་ཆགས་ཅན་ལ་སྒྲ་ལ་ཞེ་སྡང་ཅན་དང་།
en: “Sāgaramati, there are those who are desirous of form and averse to sound.

source: སྒྲ་ལ་འདོད་ཆགས་ཅན་ལ་གཟུགས་ལ་ཞེ་སྡང་ཅན་དང་།
en: There are those who are desirous of sound and averse to form.

source: དྲི་ལ་འདོད་ཆགས་ཅན་ལ་རོ་ལ་ཞེ་སྡང་ཅན་དང་།
en: There are those who are desirous of smell and averse to taste.

source: རོ་ལ་འདོད་ཆགས་ཅན་ལ་དྲི་ལ་ཞེ་སྡང་ཅན་དང་།
en: There are those who are desirous of taste and averse to smell.

source: རེག་པ་ལ་འདོད་ཆགས་ཅན་ལ་ཆོས་ལ་ཞེ་སྡང་ཅན་དང་།
en: There are those who are desirous of touch and averse to mental phenomena.

source: ཆོས་ལ་འདོད་ཆགས་ཅན་ལ་རེག་པ་ལ་ཞེ་སྡང་ཅན་གྱི་སེམས་ཅན་དག་ཀྱང་ཡོད་དོ། །
en: There are those who are desirous of mental phenomena and averse to touch.

source: བློ་གྲོས་རྒྱ་མཚོ་གཟུགས་ལས་དབེན་པས་འདུལ་བར་འགྱུར་གྱི་སྒྲ་ལས་དབེན་པས་ནི་མ་ཡིན་པའི་སེམས་ཅན་དག་ཀྱང་ཡོད།
en: “Sāgaramati, there are beings who can be guided by disengaging from form, but not from sound.

source: སྒྲ་ལས་དབེན་པས་འདུལ་བར་འགྱུར་གྱི་གཟུགས་ལས་དབེན་པས་མ་ཡིན་པ་དག་ཀྱང་ཡོད།
en: There are beings who can be guided by disengaging from sound, but not from form.

source: དྲི་ལས་དབེན་པས་འདུལ་བར་འགྱུར་གྱི་རོ་ལས་དབེན་པས་ནི་མ་ཡིན་པ་དག་ཀྱང་ཡོད།
en: There are beings who can be guided by disengaging from smell, but not from taste.

source: རོ་ལས་དབེན་པས་འདུལ་བར་འགྱུར་གྱི་དྲི་ལས་དབེན་པས་མ་ཡིན་པ་དག་ཀྱང་ཡོད།
en: There are beings who can be guided by disengaging from taste, but not from smell.

source: རེག་པ་ལས་དབེན་པས་འདུལ་བར་འགྱུར་གྱི། ཆོས་ལས་དབེན་པས་མ་ཡིན་པ་དག་ཀྱང་ཡོད།
en: There are beings who can be guided by disengaging from touch, but not from mental phenomena.

source: ཆོས་ལས་དབེན་པས་འདུལ་བར་འགྱུར་གྱི་རེག་པ་ལས་དབེན་པས་མ་ཡིན་པ་དག་ཀྱང་ཡོད་དོ། །
en: There are beings who can be guided by disengaging from mental phenomena, but not from touch.

source: བློ་གྲོས་རྒྱ་མཚོ་ལུས་དབེན་པས་འདུལ་བར་འགྱུར་གྱི་སེམས་དབེན་པས་མུ་ཡིན་པའི་སེམས་ཅན་དག་ཀྱང་ཡོད།
en: “Sāgaramati, there are beings who can be guided by disengaging from body, but not from mind.

source: སེམས་དབེན་པས་འདུལ་བར་འགྱུར་གྱི་ལུས་དབེན་པས་མ་ཡིན་པ་དག་ཀྱང་ཡོད།
en: There are beings who can be guided by disengaging from mind, but not from body.

source: ལུས་དབེན་པ་དང་སེམས་དབེན་པས་འདུལ་བར་འགྱུར་བ་དག་ཀྱང་ཡོད། ལུས་དབེན་པ་དང་སེམས་དབེན་པས་འདུལ་བར་འགྱུར་བ་མ་ཡིན་པ་དག་ཀྱང་ཡོད་དོ། །
en: There are beings who can be guided by disengaging from body and mind, and there are those who cannot be guided by disengaging from body or mind.

source: བློ་གྲོས་རྒྱ་མཚོ་མི་རྟག་པའི་སྒྲས་འདུལ་བར་འགྱུར་གྱི་སྡུག་བསྔལ་དང་བདག་མེད་པ་དང་ཞི་བའི་སྒྲ་རྣམས་ཀྱིས་མ་ཡིན་པའི་སེམས་ཅན་དག་ཀྱང་ཡོད།
en: “Sāgaramati, there are beings who can be guided by the message of impermanence, but not by the messages of suffering, selflessness, or peace.

source: སྡུག་བསྔལ་གྱི་སྒྲས་འདུལ་བར་འགྱུར་གྱི་མི་རྟག་པ་དང་བདག་མེད་པ་དང་ཞི་བའི་སྒྲ་རྣམས་ཀྱིས་མ་ཡིན་པ་དག་ཀྱང་ཡོད།
en: There are beings who can be guided by the message of suffering, but not by the messages of impermanence, selflessness, or peace.

source: བདག་མེད་པའི་སྒྲས་འདུལ་བར་འགྱུར་གྱི་མི་རྟག་པ་དང་སྡུག་བསྔལ་བ་དང་ཞི་བའི་སྒྲ་རྣམས་ཀྱིས་མ་ཡིན་པ་དག་ཀྱང་ཡོད།
en: There are beings who can be guided by the message of selflessness, but not by the messages of impermanence, suffering, or peace.

source: ཞི་བའི་སྒྲས་འདུལ་བར་འགྱུར་གྱི་མི་རྟག་པ་དང་སྡུག་བསྔལ་བ་དང་བདག་མེད་པའི་སྒྲ་རྣམས་ཀྱིས་མ་ཡིན་པ་དག་ཀྱང་ཡོད་དོ། །
en: There are beings who can be guided by the message of peace, but not by the messages of impermanence, suffering, or selflessness.

source: བློ་གྲོས་རྒྱ་མཚོ་ཀུན་རྗོད་པའི་ཆོ་འཕྲུལ་གྱིས་འདུལ་བར་འགྱུར་གྱི་རྗེས་སུ་བསྟན་པའི་ཆོ་འཕྲུལ་གྱིས་མ་ཡིན་པའི་སེམས་ཅན་དག་ཀྱང་ཡོད།
en: “Sāgaramati, there are beings who can be guided by miracles based on speech, but not by miracles based on instruction.

source: རྗེས་སུ་བསྟན་པའི་ཆོ་འཕྲུལ་གྱིས་འདུལ་བར་འགྱུར་གྱི་ཀུན་རྗོད་པའི་ཆོ་འཕྲུལ་གྱིས་མ་ཡིན་པའི་སེམས་ཅན་དག་ཀྱང་ཡོད།
en: There are beings who can be guided by miracles based on instruction, but not by miracles based on speech.

source: རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་གྱིས་འདུལ་བར་འགྱུར་གྱི་ཀུན་རྗོད་པ་དང་། རྗེས་སུ་བསྟན་པའི་ཆོ་འཕྲུལ་གྱིས་མ་ཡིན་པའི་སེམས་ཅན་དག་ཀྱང་ཡོད།
en: There are beings who can be guided by miracles based on miraculous powers, but not by miracles based on speech or instruction.

source: ཀུན་རྗོད་པའི་ཆོ་འཕྲུལ་གྱིས་རྣམ་པར་གྲོལ་བར་འགྱུར་བ་དང་།
en: There are beings who can be liberated by miracles based on speech.

source: རྗེས་སུ་བསྟན་པའི་ཆོ་འཕྲུལ་གྱིས་རྣམ་པར་གྲོལ་བར་འགྱུར་བ་དང་།
en: There are beings who can be liberated by miracles based on instruction.

source: རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་གྱིས་རྣམ་པར་གྲོལ་བར་འགྱུར་བའི་སེམས་ཅན་དག་ཀྱང་ཡོད་དོ། །
en: There are beings who can be liberated by miracles based on miraculous powers.

source: བློ་གྲོས་རྒྱ་མཚོ་སྦྱོར་བ་མྱུར་ལ་རྣམ་པར་གྲོལ་བ་བུལ་བའི་སེམས་ཅན་དག་ཀྱང་ཡོད།
en: “Sāgaramati, there are beings for whom practice will come swiftly but liberation slowly.

source: སྦྱོར་བ་བུལ་ལ་རྣམ་པར་གྲོལ་བ་མྱུར་བ་དག་ཀྱང་ཡོད།
en: There are beings for whom practice will come slowly but liberation swiftly.

source: སྦྱོར་བ་ཡང་བུལ་ལ་རྣམ་པར་གྲོལ་བ་ཡང་བུལ་བ་དག་ཀྱང་ཡོད།
en: There are beings for whom both practice and liberation will come slowly.

source: སྦྱོར་བ་ཡང་མྱུར་ལ་རྣམ་པར་གྲོལ་བ་མྱུར་བ་དག་ཀྱང་ཡོད་དོ། །
en: There are beings for whom both practice and liberation will come swiftly.

source: བློ་གྲོས་རྒྱ་མཚོ་རྒྱུ་རྣམས་ཀྱིས་རྣམ་པར་གྲོལ་གྱི་རྐྱེན་རྣམས་ཀྱིས་མ་ཡིན་པའི་སེམས་ཅན་དག་ཀྱང་ཡོད།
en: “Sāgaramati, there are beings who can be liberated by causes, but not by conditions.

source: རྐྱེན་རྣམས་ཀྱིས་རྣམ་པར་གྲོལ་གྱི་རྒྱུ་རྣམས་ཀྱིས་མ་ཡིན་པ་དག་ཀྱང་ཡོད།
en: There are beings who can liberated by conditions but not by causes.

source: རྒྱུ་རྣམས་དང་རྐྱེན་རྣམས་ཀྱིས་རྣམ་པར་གྲོལ་བ་དག་ཀྱང་ཡོད།
en: There are beings who can be liberated by both causes and conditions.

source: རྒྱུ་རྣམས་དང་རྐྱེན་རྣམས་ཀྱིས་རྣམ་པར་གྲོལ་བ་མ་ཡིན་པ་དག་ཀྱང་ཡོད་དོ། །
en: There are also beings who cannot be liberated by either causes or conditions.

source: བློ་གྲོས་རྒྱ་མཚོ་ནང་གི་སྐྱོན་མཐོང་བས་རྣམ་པར་གྲོལ་གྱི་ཕྱི་རོལ་གྱི་སྐྱོན་མཐོང་བས་མ་ཡིན་པའི་སེམས་ཅན་དག་ཀྱང་ཡོད།
en: “Sāgaramati, there are beings who can be liberated by seeing inner flaws, but not by seeing outer flaws.

source: ཕྱི་རོལ་གྱི་སྐྱོན་མཐོང་བས་རྣམ་པར་གྲོལ་གྱི་ནང་གི་སྐྱོན་མཐོང་བས་མ་ཡིན་པ་དག་ཀྱང་ཡོད།
en: There are beings who can be liberated by seeing outer flaws, but not by seeing inner flaws.

source: ནང་གི་སྐྱོན་མཐོང་བ་དང་ཕྱི་རོལ་གྱི་སྐྱོན་མཐོང་བ་རྣམ་པར་གྲོལ་བ་དག་ཀྱང་ཡོད།
en: There are beings who can be liberated by seeing both inner and outer flaws.

source: ནང་གི་སྐྱོན་མཐོང་བ་དང་ཕྱི་རོལ་གྱི་སྐྱོན་མཐོང་བ་རྣམ་པར་གྲོལ་བ་མ་ཡིན་པ་དག་ཀྱང་ཡོད་དོ། །
en: There are beings who cannot be liberated by seeing either inner or outer flaws.

source: བློ་གྲོས་རྒྱ་མཚོ་སླ་བའི་ལམ་གྱིས་རྣམ་པར་གྲོལ་བ་ཐོབ་པར་འགྱུར་གྱིས། དཀའ་བར་འགྱུར་བའི་ལམ་གྱིས་མ་ཡིན་པའི་སེམས་ཅན་དག་ཀྱང་ཡོད།
en: “Sāgaramati, some beings can attain liberation through the path of ease, but not through the path of hardship.

source: དཀའ་བའི་ལམ་གྱིས་འགྱུར་གྱི་སླ་བའི་ལམ་གྱིས་མ་ཡིན་པ་དག་ཀྱང་ཡོད།
en: Yet, for some it will occur through the path of hardship, and not of ease.

source: དཀའ་བ་དང་སླ་བས་འགྱུར་བ་དག་ཀྱང་ཡོད།
en: For some a combination of hardship and ease will bring it about.

source: སླ་བ་དང་དཀའ་བའི་ལམ་གྱིས་རྣམ་པར་གྲོལ་བ་ཐོབ་པར་མི་འགྱུར་བ་དག་ཀྱང་ཡོད་དོ། །
en: Still, there are some who cannot attain freedom through either the path of ease or hardship.

source: བློ་གྲོས་རྒྱ་མཚོ་མགུར་བསལ་བའི་སྒྲས་འདུལ་བའི་སེམས་ཅན་དག་ཀྱང་ཡོད། རབ་ཏུ་བརྟན་པས་འདུལ་བ་དག་ཀྱང་ཡོད། ཚར་གཅད་པས་འདུལ་བ་དག་ཀྱང་ཡོད། རབ་ཏུ་གཟུང་བས་འདུལ་བ་དག་ཀྱང་ཡོད། སྡུག་པའི་རྣམ་པས་འདུལ་བ་དག་ཀྱང་ཡོད། མི་སྡུག་པའི་རྣམ་པས་འདུལ་བ་དག་ཀྱང་ཡོད། ཞེ་སྡང་གི་རྣམ་པས་འདུལ་བ་དག་ཀྱང་ཡོད། བྱམས་པའི་རྣམ་པས་འདུལ་བ་དག་ཀྱང་ཡོད། སྨ་དབབ་པས་འདུལ་བའི་རྣམ་པ་དག་ཀྱང་ཡོད། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བས་འདུལ་བ་དག་ཀྱང་ཡོད།
en: “Sāgaramati, some beings can be guided through directives, and others though support, being cut down , being accepted, beauty, ugliness, aggression, love, cursing, and dependent origination.

source: རྗེས་སུ་འཐུན་པར་རྒྱུ་བས་འདུལ་བ་དག་ཀྱང་ཡོད། སྤྱིའུ་ཚུགས་སུ་རྒྱུ་བས་འདུལ་བ་དག་ཀྱང་ཡོད། སྣྲེལ་ཞིར་རྒྱུ་བས་འདུལ་བ་དག་ཀྱང་ཡོད།
en: Some beings can be guided by pleasant destinies, others by hellish destinies, and still others by transverse destinies.

source: དྲན་པ་ཉེ་བར་གཞག་པའི་སྒྲས་འདུལ་བ་དག་ཀྱང་ཡོད། ཡང་དག་པར་སྤོང་བའི་སྒྲས་འདུལ་བ་དག་ཀྱང་ཡོད། རྫུ་འཕྲུལ་གྱི་རྐང་པའི་སྒྲས་འདུལ་བ་དག་ཀྱང་ཡོད། དབང་པོའི་སྒྲས་འདུལ་བ་དག་ཀྱང་ཡོད། །སྟོབས་ཀྱི་སྒྲས་འདུལ་བ་དག་ཀྱང་ཡོད། བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་སྒྲས་འདུལ་བ་དག་ཀྱང་ཡོད། ལམ་གྱི་སྒྲས་འདུལ་བ་དག་ཀྱང་ཡོད། ཞི་གནས་ཀྱི་སྒྲས་འདུལ་བ་དག་ཀྱང་ཡོད། ལྷག་མཐོང་གིས་སྒྲས་འདུལ་བ་དག་ཀྱང་ཡོད་དོ། །
en: “There are also some beings who can be guided by teachings on the applications of mindfulness, teachings on the right abandonments, teachings on the bases of miracles, teachings on the faculties, teachings on the strengths , teachings on the branches of awakening, teachings on the path, teachings on tranquility, or teachings on special insight.

source: བློ་གྲོས་རྒྱ་མཚོ་འཕགས་པའི་བདེན་པ་བསྟན་པའི་སྒྲས་འདུལ་བའི་སེམས་ཅན་དག་ཀྱང་ཡོད་དོ། །
en: Some beings, Sāgaramati, can also be guided by teachings that describe the truths of the noble ones.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལྟར་ན་སེམས་ཅན་གྱི་སྤྱོད་པ་བསམ་གྱིས་མི་ཁྱབ།
en: “In this way, Sāgaramati, the conduct of beings is unfathomable.

source: སེམས་ཅན་གྱི་བསམ་པ་བསམ་གྱིས་མི་ཁྱབ།
en: The thoughts of beings are unfathomable.

source: སེམས་ཅན་གྱིས་སྤྱོད་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་བོ། །
en: The experience of beings is unfathomable.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་པ་འཇུག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་ཞུགས་ནས་སེམས་ཅན་བསམ་གྱིས་མི་ཁྱབ་པ་རྣམས་ཀྱི་སྤྱོད་པ་འཇུག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་འཇུག་པར་ནུས་སོ། །
en: Thus, when bodhisattvas enter into unfathomable penetrating knowing, they are able to penetrate the unfathomable forms of conduct of unfathomable beings.

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ལྟ་སྟེ་དཔེར་ན། ཀུན་ནས་ཞགས་པ་ཞེས་བྱ་བའི་དྲ་བ་དེར་སྐྱེས་བུ་ཞིག་བཅུག་པར་གྱུར་ལ།
en: “Sāgaramati, to draw an analogy, suppose a person was caught in a net called ‘completely lassoed.’

source: སྐྱེས་བུ་དེས་ཞགས་པ་ཐམས་ཅད་ལས་འབྱིན་པ་ཞེས་བྱ་བའི་སྔགས་ཀྱི་རིག་པའི་སྟོབས་བསྐྱེད་ན་དྲ་བ་དེར་བཅུག་མ་ཐག་ཏུ་སྔགས་ཀྱི་རིག་པའི་སྟོབས་ཀྱིས་ཞགས་པའི་འཆིང་བ་ཐམས་ཅད་བཅད་ནས་
en: Were that person to draw on the power of the spell called ‘deliverer from all lassoes,’ then as soon as they became ensnared, they could utilize that spell to instantly cut through all the fetters.

source: གང་དགའ་བ་དེར་འགྲོའོ། །
en: They would then be free to go where they pleased.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་བཞིན་དུ་ཐབས་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ལ་ཞུགས་ནས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྔགས་ཀྱི་རིག་པའི་སྟོབས་ཀྱིས་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་འཆིང་བ་ཐམས་ཅད་གཅོད་དེ།
en: Likewise, Sāgaramati, penetrating the thoughts of all beings, bodhisattvas who are skilled in means can cut all the binding afflictive emotions of beings with the power of the spell of the perfection of insight.

source: སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་དེ་ལ་མ་རེག་ཀྱང་སངས་རྒྱས་ཀྱི་མཛད་པས་སེམས་ཅན་རྣམས་ལ་ཉེ་བར་གནས་པ་ཡིན་ནོ། །
en: Though they have not yet reached the wisdom of a buddha, they enact buddha activity, and thus remain close to beings.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Venerable Śāradvatīputra then remarked to the Buddha,

source: བཅོམ་ལྡན་འདས་ཇི་ཙམ་དུ་སེམས་ཅན་གྱི་སྤྱོད་པ་ཚད་མ་མཆིས་པ་དང་། ཇི་ཙམ་དུ་སངས་རྒྱས་ཀྱིས་མཁྱེན་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ངོ་མཚར་ཏོ། །
en: “Blessed One, the extent of beings’ limitless modes of conduct and the unfathomable wisdom of the buddhas is incredible.

source: བཅོམ་ལྡན་འདས་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ལས་དང་པོ་པས་སེམས་ཅན་གྱི་སྤྱོད་པ་ཚད་མ་མཆིས་པ་དང་། སངས་རྒྱས་ཀྱི་མཁྱེན་པ་ཚད་མ་མཆིས་པ་འདི་དག་ཐོས་ནས་མི་སྐྲག་མི་དངང་དངང་བར་མི་འགྱུར་བ་འདི་ནི་བདག་ལ་ཤིན་ཏུ་ངོ་མཚར་དུ་གདའོ། །
en: Blessed One, it truly amazes me that when novice bodhisattvas first hear of the extent of beings’ limitless modes of conduct and the unfathomable wisdom of the buddhas, they are not intimidated, scared, or unnerved.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One responded to the Venerable Śāradvatīputra,

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། སེང་གེའི་ཕྲུག་གུས་སེང་གེའི་སྒྲ་ཐོས་ན་སྐྲག་པའམ་དངང་བའམ། ཀུན་ཏུ་དངང་བར་འགྱུར་རམ།
en: “Tell me, Śāradvatīputra, when lion cubs hear a lion’s roar, are they intimidated, scared, or unnerved?”

source: གསོལ་པ་བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །
en: “Blessed One, they are not.”

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ལས་དང་པོ་པ་ཡང་དེ་བཞིན་གཤེགས་པའི་སེང་གེའི་སྒྲ་ཐོས་ན་མི་སྐྲག་མི་དངང་དངང་བར་མི་འགྱུར་རོ། །
en: “Likewise, Śāradvatīputra, when novice bodhisattvas hear the Thus-Gone One’s lion’s roar, they are not intimidated, scared, or unnerved.

source: སེམས་ཅན་གྱི་སྤྱོད་པ་ཚད་མེད་པ་ཐོས་ནས་ཀྱང་འཇིགས་པར་མི་འགྱུར་རོ། །
en: They are not frightened by hearing of beings’ limitless modes of conduct.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་མེའི་སྣང་བ་ཆུང་ངུ་ཡང་ཤིང་དང་རྩྭ་ཐམས་ཅད་ཀྱིས་མི་སྐྲག་སྟེ།
en: “Śāradvatīputra, to draw another analogy, even though a fire may be small, it will not be intimidated by any amount of trees and grass.

source: དེ་འདི་སྙམ་དུ་ཚིག་པར་བྱེད་མི་ནུས་སོ་སྙམ་དུ་མི་སེམས་སོ། །
en: It will never think that it is unable to burn them.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ལས་དང་པོ་པའི་ཤེས་རབ་ཀྱི་སྣང་བ་ཆུང་ངུ་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་རྣམས་ཀྱིས་མི་སྐྲག་སྟེ།
en: Likewise, Śāradvatīputra, even the feeble light of a novice bodhisattva’s insight is not intimidated by beings’ afflictive emotions.

source: དེ་འདི་སྙམ་དུ་བདག་གིས་ཉོན་མོངས་པ་ཞི་བར་བྱེད་མི་ནུས་སོ་སྙམ་དུ་མི་སེམས་ཀྱི།
en: They do not worry that they lack the power to pacify afflictive emotions.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་དེ་ཉིད་ལ་ཚུལ་བཞིན་དུ་ངེས་པར་བརྟགས་ནས་ཤེས་རབ་ཀྱི་རྒྱུར་འགྱུར་རོ། །
en: Accurately investigating beings’ afflictive emotions only becomes a cause of deeper insight.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ཡོངས་སུ་བརྟག་པ་ཉེ་བར་བཟུང་སྟེ། མེ་དང་། རྩྭ་དང་། ཤིང་དང་། ལོ་མ་དང་། ཡལ་ག་ཐམས་ཅད་འཐབ་ཅིང་རྩོད་པ་ཆེན་པོ་བྱ་བར་བརྩམས་ཏེ།
en: “Śāradvatīputra, to draw another analogy, imagine a scene in which fire becomes opposed to all trees, leaves, and branches. They might all prepare to fight and have a great dispute, thinking,

source: ཉི་མ་བདུན་ན་གཡུལ་ཆེན་པོ་འགྱེད་དོ་སྙམ་ནས།
en: ‘We will start a war in seven days.’

source: དེ་ན་རྩྭ་དང་ཤིང་དེ་དག་གིས་དེ་ལས་གཞན་པའི་རྩྭ་དང་། ཤིང་ཐམས་ཅད་བསྡུས་ཏེ་ངེད་ཀྱི་དཔུང་གྱིས་ཤིག །ངེད་ཀྱི་གྲོགས་གྱིས་ཤིག་ཅེས་བྱས་ནས་
en: The grass and trees would then gather other grasses and trees, commanding them to support and join rank.

source: དེ་ན་རྩྭ་དང་ཤིང་གི་ཕུང་པོ་རི་རབ་ཙམ་བསྡུས་པར་གྱུར་ལ་
en: Together they might then amass to a pile the size of Mount Meru.

source: དེ་ནས་འགའ་ཞིག་མེ་དེའི་གན་དུ་སོང་སྟེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Now, someone might then go before the fire and ask,

source: ཅིའི་ཕྱིར་ཁྱོད་དཔུང་མི་སྡུད།
en: ‘Why have you not assembled an army?

source: ཁྱོད་རྩྭ་དང་ཤིང་འདི་དག་ལས་གཅིག་པུས་རྒྱལ་བར་བྱ་སྙམ་འམ།
en: Do you think you alone can be victorious over all these grasses and trees?’

source: དེ་ནས་མི་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འདིར་བདག་གིས་དཔུང་བསྡུ་བར་བྱ་མི་དགོས་སོ། །
en: The fire would then reply, ‘I do not have to assemble an army.

source: རྩྭ་དང་ཤིང་ཕྱིར་རྒོལ་བ་དེ་དག་ཉིད་བདག་གི་གྲོགས་ཡིན་ཏེ། ཇི་ལྟ་ཇི་ལྟར་འདི་དག་མང་པོར་གྱུར་པ་དེ་ལྟ་དེ་ལྟར་བདག་སྟོབས་དང་རབ་ཏུ་ལྡན་པར་འགྱུར་རོ། །
en: Because these opposing forces of grass and trees are my support—the more they are, the stronger I become.

source: གལ་ཏེ་འདི་དག་མེད་པར་གྱུར་ན་བདག་ཀྱང་མྱུར་དུ་འཆིའོ། །
en: If they were not there, I would also swiftly perish.’

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་ཇི་ལྟ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་ཚད་མེད་པ་དག་ལ་ཤེས་རབ་ཀྱི་མེ་ཚད་མེད་པ་རབ་ཏུ་གཏོང་བ་དེ་ལྟ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཤིན་ཏུ་སྟོབས་དང་ལྡན་པར་འགྱུར་ཏེ
en: “Likewise, Śāradvatīputra, the more bodhisattvas send their limitless fire of insight toward the limitless afflictions of all beings, the stronger these bodhisattvas become.

source: དེ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་དེ་དག་ལ་ཚུལ་བཞིན་དུ་ཉེ་བར་བརྟགས་ན་ཤེས་རབ་ཀྱི་རྒྱུར་འགྱུར་རོ། །
en: Accurately investigating the afflictions of all beings becomes a cause of deeper insight.
